## Production: export 💾
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 2 to add, 2 to change, 2 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                                              NAME                                                               |
|----------|---------------------------------------------------------------------------------------------------------------------------------|
| recreate | `module.platform_notify_export.module.platform_gc_notify_export.aws_ecr_lifecycle_policy.this[0]`                               |
|          | `module.platform_support_freshdesk_export.module.platform_support_freshdesk_export.aws_ecr_lifecycle_policy.this[0]`            |
| update   | `module.platform_notify_export.module.platform_gc_notify_export.module.this_lambda.aws_lambda_function.this`                    |
|          | `module.platform_support_freshdesk_export.module.platform_support_freshdesk_export.module.this_lambda.aws_lambda_function.this` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.platform_notify_export.module.platform_gc_notify_export.aws_ecr_lifecycle_policy.this[0] must be replaced
-/+ resource "aws_ecr_lifecycle_policy" "this" {
      ~ id          = "platform-gc-notify-export" -> (known after apply)
      ~ policy      = jsonencode(
          ~ {
              ~ rules = [
                  ~ {
                      ~ description  = "Keep last 10 git SHA tagged images" -> "Keep most recent 10 images"
                      ~ selection    = {
                          - tagPrefixList = [
                              - "sha-",
                            ]
                          ~ tagStatus     = "tagged" -> "any"
                            # (2 unchanged attributes hidden)
                        }
                        # (2 unchanged attributes hidden)
                    },
                  - {
                      - action       = {
                          - type = "expire"
                        }
                      - description  = "Expire untagged images older than 7 days"
                      - rulePriority = 20
                      - selection    = {
                          - countNumber = 7
                          - countType   = "sinceImagePushed"
                          - countUnit   = "days"
                          - tagStatus   = "untagged"
                        }
                    },
                ]
            } # forces replacement
        )
      ~ registry_id = "739275439843" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.platform_support_freshdesk_export.module.platform_support_freshdesk_export.aws_ecr_lifecycle_policy.this[0] must be replaced
-/+ resource "aws_ecr_lifecycle_policy" "this" {
      ~ id          = "platform-support-freshdesk-export" -> (known after apply)
      ~ policy      = jsonencode(
          ~ {
              ~ rules = [
                  ~ {
                      ~ description  = "Keep last 10 git SHA tagged images" -> "Keep most recent 10 images"
                      ~ selection    = {
                          - tagPrefixList = [
                              - "sha-",
                            ]
                          ~ tagStatus     = "tagged" -> "any"
                            # (2 unchanged attributes hidden)
                        }
                        # (2 unchanged attributes hidden)
                    },
                  - {
                      - action       = {
                          - type = "expire"
                        }
                      - description  = "Expire untagged images older than 7 days"
                      - rulePriority = 20
                      - selection    = {
                          - countNumber = 7
                          - countType   = "sinceImagePushed"
                          - countUnit   = "days"
                          - tagStatus   = "untagged"
                        }
                    },
                ]
            } # forces replacement
        )
      ~ registry_id = "739275439843" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.platform_notify_export.module.platform_gc_notify_export.module.this_lambda.aws_lambda_function.this will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ architectures                  = [
          ~ "x86_64" -> "arm64",
        ]
        id                             = "platform-gc-notify-export"
      ~ last_modified                  = "2025-03-27T18:42:04.507+0000" -> (known after apply)
        tags                           = {
            "CostCentre" = "PlatformDataLake"
            "Terraform"  = "true"
        }
        # (26 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.platform_support_freshdesk_export.module.platform_support_freshdesk_export.module.this_lambda.aws_lambda_function.this will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ architectures                  = [
          ~ "x86_64" -> "arm64",
        ]
        id                             = "platform-support-freshdesk-export"
      ~ last_modified                  = "2025-03-24T13:36:38.000+0000" -> (known after apply)
        tags                           = {
            "CostCentre" = "PlatformDataLake"
            "Terraform"  = "true"
        }
        # (26 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

Plan: 2 to add, 2 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["module.platform_notify_export.aws_cloudwatch_metric_alarm.platform_gc_notify_error_logged"]
WARN - plan.json - main - Missing Common Tags: ["module.platform_notify_export.aws_cloudwatch_metric_alarm.platform_gc_notify_errors"]
WARN - plan.json - main - Missing Common Tags: ["module.platform_notify_export.aws_iam_policy.platform_notify_rds_snapshot_exports"]
WARN - plan.json - main - Missing Common Tags: ["module.platform_notify_export.aws_iam_role.platform_notify_rds_snapshot_exports"]
WARN - plan.json - main - Missing Common Tags: ["module.platform_notify_export.aws_kms_key.platform_notify_rds_snapshot_exports"]
WARN - plan.json - main - Missing Common Tags: ["module.platform_support_freshdesk_export.aws_cloudwatch_metric_alarm.platform_support_freshdesk_export_error_logged"]
WARN - plan.json - main - Missing Common Tags: ["module.platform_support_freshdesk_export.aws_cloudwatch_metric_alarm.platform_support_freshdesk_export_errors"]
WARN - plan.json - main - Missing Common Tags: ["module.platform_support_freshdesk_export.aws_ssm_parameter.freshdesk_api_key"]

27 tests, 19 passed, 8 warnings, 0 failures, 0 exceptions

```

</details>
